/******************************************************************************
 * 版权所有（C）2014 Android开源项目版权所有2002-2004 Open Interface North America，Inc.保留所有权利。
 *
 *  根据Apache许可证2.0版（“许可证”）获得许可；除非符合许可证，否则不得使用此文件。您可以在以下地址获取许可证副本：
 *
 *  http://www.apache.org/licenses/LICENSE-2.0
 *
 *  除非适用法律要求或书面同意，否则根据许可证分发的软件是按“原样”分发的，无任何明示或暗示的担保或条件。有关许可证下权限和限制的具体语言，请参阅许可证。
 *
 ******************************************************************************/
#ifndef _OI_COMMON_H
#define _OI_COMMON_H
/**
 * @file
 *
 * 此文件用于对常用的BLUEmagic 3.0软件头文件进行分组。
 *
 * 该文件应包含在应用程序源代码中，以及所使用的协议堆栈的特定模块的头文件中。
 */

/**********************************************************************************
  $版本：#1$
***********************************************************************************/

#include "oi_bt_spec.h"
#include "oi_stddefs.h"
#include "oi_status.h"
#include "oi_time.h"
#include "oi_osinterface.h"


/*****************************************************************************/
#endif /* _OI_COMMON_H */

