/*
 * SPDX文件版权文本：2021浓缩咖啡系统（上海）有限公司
 *
 * SPDX许可证标识符：Apache-2.0
 */

#pragma once

#ifdef __cplusplus
extern "C" {
#endif

/**
 * @brief LCD时钟源
 * @note 用户应根据实际需求选择时钟源：
 * @verbatim embed:rst:前导星号+-------------------------+-------------------------+------------------------+|LCD时钟源|功能|电源管理|+=====================+======================+==============================+|LCD_CLK_SRC_PLL160M|高分辨率|ESP_PM_APB_FREQ_MAX锁|+------------------------+-------------------+-------------------------+------------------------+|LCD_CLK_SRC_APLL |可配置分辨率|ESP_PM_NO_LIGHT_SLEEP锁定|+-------------------------+-------------------------+------------------------+|LCD_CLK-SRC_XTAL |中等分辨率|无PM锁定|+---------------------+-------------------------+----------------------------+
 * @endverbatim
 */
typedef enum {
    LCD_CLK_SRC_PLL160M, /*!< 选择PLL160M作为源时钟*/
    LCD_CLK_SRC_APLL,    /*!< 选择APLL作为源时钟*/
    LCD_CLK_SRC_XTAL,    /*!< 选择XTAL作为源时钟*/
} lcd_clock_source_t;

#ifdef __cplusplus
}
#endif

