/******************************************************************************
 * 版权所有（C）2004-2012 Broadcom Corporation
 *
 *  根据Apache许可证2.0版（“许可证”）获得许可；除非符合许可证，否则不得使用此文件。您可以在以下地址获取许可证副本：
 *
 *  http://www.apache.org/licenses/LICENSE-2.0
 *
 *  除非适用法律要求或书面同意，否则根据许可证分发的软件是按“原样”分发的，无任何明示或暗示的担保或条件。有关许可证下权限和限制的具体语言，请参阅许可证。
 *
 ******************************************************************************/

/******************************************************************************
 * 这是博通手机蓝牙应用层BTA的模拟高级音频/视频流（AV）源和接收器的公共接口文件。
 *
 ******************************************************************************/
#ifndef BTA_AR_API_H
#define BTA_AR_API_H

#include "stack/avdt_api.h"
#include "stack/avct_api.h"
#include "stack/avrc_api.h"
#include "stack/sdp_api.h"
#include "bta/bta_av_api.h"
#include "bta/bta_sys.h"

#if (BTA_AR_INCLUDED == TRUE)

/*****************************************************************************
**  常量和数据类型
*****************************************************************************/
/* 此事件向AR用户发出其他配置文件已连接的信号*/
#define BTA_AR_AVDT_CONN_EVT    (AVDT_MAX_EVT + 1)

/*******************************************************************************
** 函数bta_ar_init
**
** 说明此函数是从bta_sys_init（）调用的。初始化控制块
**
** 返回void
**
*******************************************************************************/
extern void bta_ar_init(void);

/*******************************************************************************
** 函数bta_ar_reg_avtt
**
** 说明调用此函数以注册到AVDTP。
**
** 返回void
**
*******************************************************************************/
extern void bta_ar_reg_avdt(tAVDT_REG *p_reg, tAVDT_CTRL_CBACK *p_cback, tBTA_SYS_ID sys_id);

/*******************************************************************************
** 函数bta_ar_dreg_avdt
**
** 说明调用此函数以从AVDTP中注销。
**
** 返回void
**
*******************************************************************************/
extern void bta_ar_dereg_avdt(tBTA_SYS_ID sys_id);

/*******************************************************************************
** 函数bta_ar_avdt_conn
**
** 说明调用此函数是为了让ar知道已为此sys_id连接了一些AVDTP配置文件。如果其他系统模块启动了PENDING_EVT的计时器，则可以立即停止计时器。
**
** 返回void
**
*******************************************************************************/
extern void bta_ar_avdt_conn(tBTA_SYS_ID sys_id, BD_ADDR bd_addr);

/*******************************************************************************
** 函数bta_ar_reg_avct
**
** 说明调用此函数以注册到AVCTP。
**
** 返回void
**
*******************************************************************************/
extern void bta_ar_reg_avct(UINT16 mtu, UINT16 mtu_br, UINT8 sec_mask, tBTA_SYS_ID sys_id);

/*******************************************************************************
** 函数bta_ar_dreg_avct
**
** 说明调用此函数以从AVCTP注销。
**
** 返回void
**
*******************************************************************************/
extern void bta_ar_dereg_avct(tBTA_SYS_ID sys_id);

/******************************************************************************
** 函数bta_ar_reg_avrc
**
** 说明调用此函数为AVRCP注册SDP记录。
**
** 返回void
**
******************************************************************************/
extern void bta_ar_reg_avrc(UINT16 service_uuid, char *p_service_name,
                            char *p_provider_name, UINT16 categories, tBTA_SYS_ID sys_id);

/******************************************************************************
** 函数bta_ar_dreg_avrc
**
** 说明调用此函数以取消注册/删除AVRCP的SDP记录。
**
** 返回void
**
******************************************************************************/
extern void bta_ar_dereg_avrc(UINT16 service_uuid, tBTA_SYS_ID sys_id);


#ifdef __cplusplus
}
#endif

#endif  ///BTA_AR_INCLUDED == TRUE

#endif /* BTA_AR_API_H */

