/******************************************************************************
* 版权所有2015-2017 Espressif Systems（上海）私人有限公司
*
* 根据Apache许可证2.0版（“许可证”）获得许可；除非符合许可证，否则不得使用此文件。您可以在以下地址获取许可证副本：

*     http://www.apache.org/licenses/LICENSE-2.0
*
* 除非适用法律要求或书面同意，否则根据许可证分发的软件是按“原样”分发的，无任何明示或暗示的担保或条件。有关许可证下权限和限制的具体语言，请参阅许可证。
 ******************************************************************************/

/******************************************************************************
 * 此文件包含gatts和gattc的操作函数。
 *
 *
 ******************************************************************************/

#include "stack/bt_types.h"


#ifdef __cplusplus
extern "C"
{
#endif

extern void BTA_GATT_SetLocalMTU(uint16_t mtu);

extern uint16_t BTA_GATT_GetLocalMTU(void);

#ifdef __cplusplus
}
#endif

