/******************************************************************************
 * 版权所有（C）2006-2012 Broadcom Corporation
 *
 *  根据Apache许可证2.0版（“许可证”）获得许可；除非符合许可证，否则不得使用此文件。您可以在以下地址获取许可证副本：
 *
 *  http://www.apache.org/licenses/LICENSE-2.0
 *
 *  除非适用法律要求或书面同意，否则根据许可证分发的软件是按“原样”分发的，无任何明示或暗示的担保或条件。有关许可证下权限和限制的具体语言，请参阅许可证。
 *
 ******************************************************************************/

/******************************************************************************
 * 这是设备管理器调用函数的接口文件。
 *
 ******************************************************************************/
#ifndef BTA_DM_CI_H
#define BTA_DM_CI_H

#include "bta/bta_api.h"

/*****************************************************************************
**  函数声明
*****************************************************************************/
#ifdef __cplusplus
extern "C"
{
#endif

/*******************************************************************************
** 函数bta_dm_c_io_req
**
** 说明如果bta_dm_co_io_req（）将p_oob_data设置为bta_oob_UNKNOWN，则必须响应函数bta_dm.co_io_req（）调用此函数。
**
** 返回void
**
*******************************************************************************/
extern void bta_dm_ci_io_req(BD_ADDR bd_addr, tBTA_IO_CAP io_cap,
                             tBTA_OOB_DATA oob_data, tBTA_AUTH_REQ auth_req);

/*******************************************************************************
** 函数bta_dm_c_rmt_oob
**
** 说明必须响应函数bta_dm_co_rmt_oob（）调用此函数，以提供与远程设备相关的oob数据。
**
** 返回void
**
*******************************************************************************/
extern void bta_dm_ci_rmt_oob(BOOLEAN accept, BD_ADDR bd_addr,
                              BT_OCTET16 c, BT_OCTET16 r);
#ifdef __cplusplus
}
#endif

#endif

