/******************************************************************************
 * 版权所有（C）2005-2012 Broadcom Corporation
 *
 *  根据Apache许可证2.0版（“许可证”）获得许可；除非符合许可证，否则不得使用此文件。您可以在以下地址获取许可证副本：
 *
 *  http://www.apache.org/licenses/LICENSE-2.0
 *
 *  除非适用法律要求或书面同意，否则根据许可证分发的软件是按“原样”分发的，无任何明示或暗示的担保或条件。有关许可证下权限和限制的具体语言，请参阅许可证。
 *
 ******************************************************************************/

/******************************************************************************
 * 这是高级音频/视频呼入功能的接口文件。
 *
 ******************************************************************************/
#ifndef BTA_AV_CI_H
#define BTA_AV_CI_H

#include "bta/bta_av_api.h"

#if (BTA_AV_INCLUDED == TRUE)

/*****************************************************************************
**  函数声明
*****************************************************************************/
#ifdef __cplusplus
extern "C"
{
#endif

/*******************************************************************************
** 函数bta_av_ci_src_data_ready
**
** 说明此功能向AV发送一个事件，指示手机已准备好发送音频流数据，AV应调用bta_AV_co_audio_src_data_path（）或bta_AV _co_video_src_data _path（。
**
** 返回void
**
*******************************************************************************/
extern void bta_av_ci_src_data_ready(tBTA_AV_CHNL chnl);

/*******************************************************************************
** 函数bta_av_ci_setconfig
**
** 说明必须响应函数bta_av_co_audio_setconfig（）或bta_av _co_video_setconfig调用此函数。参数err_code被设置为AVDTP状态值；如果编解码器配置正常，则为AVDT_SUCCESS，否则为错误。
**
** 返回void
**
*******************************************************************************/
extern void bta_av_ci_setconfig(tBTA_AV_HNDL hndl, UINT8 err_code,
                                UINT8 category, UINT8 num_seid, UINT8 *p_seid,
                                BOOLEAN recfg_needed, UINT8 avdt_handle);


#ifdef __cplusplus
}
#endif

#endif  ///BTA_AV_INCLUDED == TRUE

#endif /* BTA_AV_CI_H */

