/******************************************************************************
 * 版权所有（C）1999-2012 Broadcom Corporation
 *
 *  根据Apache许可证2.0版（“许可证”）获得许可；除非符合许可证，否则不得使用此文件。您可以在以下地址获取许可证副本：
 *
 *  http://www.apache.org/licenses/LICENSE-2.0
 *
 *  除非适用法律要求或书面同意，否则根据许可证分发的软件是按“原样”分发的，无任何明示或暗示的担保或条件。有关许可证下权限和限制的具体语言，请参阅许可证。
 *
 ******************************************************************************/

/******************************************************************************
 * 此文件包含端口仿真实体单元的外部定义
 *
 ******************************************************************************/

#ifndef PORTEXT_H
#define PORTEXT_H


/* 端口仿真实体入口点*/
extern void rfcomm_process_timeout (TIMER_LIST_ENT  *p_tle);
#endif

