/******************************************************************************
 * 版权所有（C）2002-2012 Broadcom Corporation
 *
 *  根据Apache许可证2.0版（“许可证”）获得许可；除非符合许可证，否则不得使用此文件。您可以在以下地址获取许可证副本：
 *
 *  http://www.apache.org/licenses/LICENSE-2.0
 *
 *  除非适用法律要求或书面同意，否则根据许可证分发的软件是按“原样”分发的，无任何明示或暗示的担保或条件。有关许可证下权限和限制的具体语言，请参阅许可证。
 *
 ******************************************************************************/

/******************************************************************************
 * 2DP内部头文件
 *
 ******************************************************************************/
#ifndef A2D_INT_H
#define A2D_INT_H

#include "stack/a2d_api.h"
#if (A2D_INCLUDED == TRUE)
/*****************************************************************************
**  常量
*****************************************************************************/
#define A2D_VERSION             0x0102

/* A2D SDP记录中的属性数。*/
#define A2D_NUM_ATTR            6

/* 协议元素列表中的协议元素数。*/
#define A2D_NUM_PROTO_ELEMS     2

/*****************************************************************************
**  类型定义
*****************************************************************************/

/* A2D_FindService（）使用的控制块。*/
typedef struct {
    tA2D_FIND_CBACK     *p_cback;       /* 指向应用程序回调的指针*/
    tSDP_DISCOVERY_DB   *p_db;          /* 指向发现数据库的指针*/
    UINT16              service_uuid;   /* 搜索的服务UUID*/
} tA2D_FIND_CB;

typedef struct {
    tA2D_FIND_CB    find;   /* 查找服务控制块*/
    UINT8           trace_level;
    UINT16          avdt_sdp_ver;   /* AVDTP版本*/
} tA2D_CB;


#ifdef __cplusplus
extern "C"
{
#endif

/******************************************************************************
** 主控制块
*******************************************************************************/
#if A2D_DYNAMIC_MEMORY == FALSE
extern tA2D_CB  a2d_cb;
#else
extern tA2D_CB *a2d_cb_ptr;
#define a2d_cb (*a2d_cb_ptr)
#endif

/* 仅用于一致性测试*/
extern void a2d_set_avdt_sdp_ver (UINT16 avdt_sdp_ver);

#ifdef __cplusplus
}
#endif
#endif  ///A2D_INCLUDED == TRUE
#endif /* A2D_INT_H */

