/******************************************************************************
 * 版权所有（C）2003-2012 Broadcom Corporation
 *
 *  根据Apache许可证2.0版（“许可证”）获得许可；除非符合许可证，否则不得使用此文件。您可以在以下地址获取许可证副本：
 *
 *  http://www.apache.org/licenses/LICENSE-2.0
 *
 *  除非适用法律要求或书面同意，否则根据许可证分发的软件是按“原样”分发的，无任何明示或暗示的担保或条件。有关许可证下权限和限制的具体语言，请参阅许可证。
 *
 ******************************************************************************/

/******************************************************************************
 * 其中包含AVCTP规范中的常量定义和其他信息。此文件仅供AVCT内部使用。
 *
 ******************************************************************************/
#ifndef AVCT_DEFS_H
#define AVCT_DEFS_H

/*****************************************************************************
** 常量
*****************************************************************************/

/* 数据包类型*/
#define AVCT_PKT_TYPE_SINGLE        0       /* 单个数据包*/
#define AVCT_PKT_TYPE_START         1       /* 起始数据包*/
#define AVCT_PKT_TYPE_CONT          2       /* 继续数据包*/
#define AVCT_PKT_TYPE_END           3       /* 结束数据包*/

/* 不同数据包类型的报头长度*/
#define AVCT_HDR_LEN_SINGLE         3
#define AVCT_HDR_LEN_START          4
#define AVCT_HDR_LEN_CONT           1
#define AVCT_HDR_LEN_END            1

/* cr+ipid值无效*/
#define AVCT_CR_IPID_INVALID        1

/*****************************************************************************
** 消息分析和生成宏
*****************************************************************************/

#define AVCT_BLD_HDR(p, label, type, cr_ipid) \
    *(p)++ = ((label) << 4) | ((type) << 2) | (cr_ipid);

#define AVCT_PRS_HDR(p, label, type, cr_ipid) \
    label = *(p) >> 4; \
    type = (*(p) >> 2) & 3; \
    cr_ipid = *(p)++ & 3;

#define AVCT_PRS_PKT_TYPE(p, type) \
    type = (*(p) >> 2) & 3;

#endif /* AVCT_DEFS_H */

