// 版权所有2015-2016 Espressif Systems（上海）私人有限公司
//
// 根据Apache许可证2.0版（“许可证”）获得许可；
// 除非符合许可证，否则不得使用此文件。
// 您可以在以下地址获取许可证副本：

//     http://www.apache.org/licenses/LICENSE-2.0
//
// 除非适用法律要求或书面同意，软件
// 根据许可证分发的内容是按“原样”分发的，
// 无任何明示或暗示的保证或条件。
// 有关管理权限和
// 许可证下的限制。

/*******************************************************************************
 * 文件名：btc_a2dp.h
 *
 *  说明：A2DP的通用定义
 *
 *******************************************************************************/

#ifndef __BTC_A2DP_H__
#define __BTC_A2DP_H__

#include <stdbool.h>
#include "common/bt_target.h"
#include "bta/bta_api.h"
#include "btc_av_api.h"
#include "esp_a2dp_api.h"

#if BTC_AV_INCLUDED

/*******************************************************************************
 **  常量
 *******************************************************************************/
#define BTC_AV_SUCCESS                             (0)
/**
 * AV（音频视频源）错误
 */
#define BTC_ERROR_SRV_AV_NOT_ENABLED               700     /* AV未启用*/
#define BTC_ERROR_SRV_AV_FEEDING_NOT_SUPPORTED     701     /* 不支持请求的进纸*/
#define BTC_ERROR_SRV_AV_BUSY                      702     /* 另一项操作正在进行*/
#define BTC_ERROR_SRV_AV_NOT_OPENED                703     /* 未打开AV链接*/
#define BTC_ERROR_SRV_AV_NOT_STARTED               704     /* AV未启动*/
#define BTC_ERROR_SRV_AV_CP_NOT_SUPPORTED          705     /* 并非所有耳机都支持内容保护*/

/* TxTranscoding和RxTranscoding的代码转换定义*/
#define BTC_MEDIA_TRSCD_OFF                        0
#define BTC_MEDIA_TRSCD_PCM_2_SBC                  1       /* 发送*/


/*******************************************************************************
 **  数据类型
 *******************************************************************************/
typedef int tBTC_AV_STATUS;

/*******************************************************************************
 **  公共职能
 *******************************************************************************/

void btc_a2dp_on_init(void);

/*******************************************************************************
 ** 函数btc_a2dp_on_idle
 **
 ** 说明初始化期间处理BTC AV状态机的“空闲”请求
 **
 *******************************************************************************/
void btc_a2dp_on_idle(void);

/*******************************************************************************
 ** 函数btc_a2dp_on_started
 **
 ** 说明处理来自BTC AV状态机的“启动”请求，以准备A2DP流
 **
 ** 如果发送了本地命令的ACK，则返回TRUE
 **
 *******************************************************************************/
BOOLEAN btc_a2dp_on_started(tBTA_AV_START *p_av, BOOLEAN pending_start);

/*******************************************************************************
 ** 函数btc_a2dp_on_stopped
 **
 ** 说明处理来自BTC AV状态机的“停止”请求以停止A2DP流
 **
 *******************************************************************************/
void btc_a2dp_on_stopped(tBTA_AV_SUSPEND *p_av);

/*******************************************************************************
 ** 函数btc_a2dp_on_suspended
 **
 ** 说明处理来自BTC AV状态机的“停止”请求以暂停A2DP流
 **
 *******************************************************************************/
void btc_a2dp_on_suspended(tBTA_AV_SUSPEND *p_av);

#endif /* #如果BTC_AV_INCLUDED*/

#endif /* __BTC_A2DP_H__ */

